sage: M = matrix([[.5, .3, .35], [.25, .4, .35], [.25, .3, .3]])                
sage: v = vector([100, 100, 100])
sage: M*v                                                                       
(115.000000000000, 100.000000000000, 85.0000000000000)

sage: A = matrix([[0,0,1,1/2],[1/3,0,0,0],[1/3,1/2,0,1/2],[1/3,1/2,0,0]])
sage: v = vector([1/4,1/4,1/4,1/4])
sage: A^34*v                                                                    
(1150464574049/2972033482752, 287616143213/2229025112064, 5177090584417/17832200896512, 3451393722097/17832200896512)
sage: N(A^34*v)                                                                 
(0.387096774220629, 0.129032257939291, 0.290322580732569, 0.193548387107510)

