sage: real(1+i)
1
sage: real(exp(i))
cos(1)
sage: imaginary(1+i)
1

sage: abs(1+i)
sqrt(2)

sage: arg(1+i)
1/4*pi

sage: log(-i)
-1/2*I*pi
sage: log(-1)
I*pi
sage: log(-1+0.001*I)
4.99999750058881e-7 + 3.14059265392313*I
sage: log(-1-0.001*I)
4.99999750058881e-7 - 3.14059265392313*I

